public class D {
    public static void main (String []args){
     A a = new A();
     B b = new B();
     c CC = new c();

     A r;
     r = a;
     r.callme();

     r = b;
     r.callme();

     r = CC;
     r.callme();
    }
}
//Если метод подкласса и суперкласса имеют одинаковые имена и типы входных данных то метод суперласса
// Переопределяется и скрывается.Вызывается метод подкласса . Чтобы вызвать Метод суперкласса нужно испозьзовать ключевое слово метод.super
// Если у методов разные типы данных то метод перегружается.